/*
برنامج الأسانسير ( المصعد )
بعض المصاعد يجب ألا يدخلها أكثر من 5 أشخاص و أن يكون مجموع وزنهم أقل من 500 كيلو حتى لا ينهار المصعد .

المطلوب : اكتب برنامج يطلب من الشخص أن يدخل 5 أرقام و يقوم بجمعهم، لو المجموع أكبر من 500 يطبع  " Error, more than 500 kg "، و اذا كان المجموع أقل من أو يساوى 500 يطبع " Okay "

*/
#include <stdio.h>
int main()
{

    float w1, w2, w3, w4, w5, sum;

    scanf("%f%f%f%f%f", &w1, &w2, &w3, &w4, &w5);

    sum = w1 + w2 + w3 + w4 + w5;

    if(sum >= 500)
        printf("أطرد شخص\n");
    else
        printf("شغال أباشا\n");

    return 0;
}